""" Урок 2. Циклы (for, while)

Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 
Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты вверх одной и той же стороной. 
Выведите минимальное количество монет, которые нужно перевернуть

N = int(input("Введите количество монет "))
D = N
eagle = 0
count = 0
while N > 0:
    eagle = int(input("введите орел - 1 или решка - 0 "))
    if eagle > 0:
        count += 1
    N -= 1
if (D-count) > count:
    print(f"чтобы все монетки лежали одной стороной нужно перевернуть {count} монет")
else:
    print(f"чтобы все монетки лежали одной стороной нужно перевернуть {D-count} монет")



Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике. 
Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для этого Петя делает две подсказки. 
Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа."""


S = int(input())
P = int(input())
x=0
y=0

for y in range (0, 20):
    x = S - y
    if x*y == P:
        print(x,y)
        



"""Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.


N = int(input())
R = 0
flag = True
for i in range (0,N):
    R = 2**i
    if R < N:
        print(R)
    else:
        flag = False
    i +=1"""